CFD_results/short/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
74874
(
(-0.0117584535523873 0.0290260034692715 1.06133666116001)
(-0.00991931558128003 0.0140639892923451 1.03636899718121)
(0.00404285587801625 0.00134097734527046 1.06184323721347)
(-0.00671788174170615 -0.00592395491516616 1.07681761247181)
(-0.000661013928999076 -0.000140679830394015 1.07003812340629)
(0.00432419668053105 -0.00558816113703328 1.06451271488329)
(0.0205741554733509 0.00653247365396381 1.04849625291064)
(0.0170376094201419 -0.0113507582273398 1.07455464056061)
...
)
;

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 3e-05;
        extrapolateProfile false;
        value           nonuniform List<vector> 
142
(
(4.87387197056056e-12 -2.48763963305461e-12 1.06790326449034)
(-2.11882386622203e-12 4.39209020312843e-12 1.06790326449034)
(2.31383306490556e-12 9.61934472386297e-14 1.06790326449034)
(-6.18200138329654e-12 1.04393490848344e-11 1.06790326449034)
(3.44699526071951e-13 3.71941847876371e-12 1.06790326449034)
(1.18619820555911e-12 1.60152650015874e-12 1.06790326449034)
(5.6867074945147e-12 -3.22625788373021e-12 1.06790326449034)
(-5.12562114395465e-12 9.8658427698543e-12 1.06790326449034)
...
)
;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
404
(
(-0.157241337145631 -0.0714547115682611 -0.433590584459756)
(-0.179015987393771 -0.0839803408996765 -0.445832247204741)
(-0.17909694612425 -0.0954364606011381 -0.477777131309527)
(-0.185145695482648 -0.0866261719480629 -0.468502276493271)
(-0.162666992832299 -0.102006137521139 -0.411712799301677)
(-0.150898135592666 -0.101288428263702 -0.430062599168685)
(-0.190877507639318 -0.0904511936494847 -0.44760630545174)
(-0.199870758682025 -0.0855241936152738 -0.463935736967905)
...
)
;
    }
    wall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
