CFD_results/short/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
212539
(
-4.154363852665e-09
-2.633891966539e-07
-3.52892309482201e-09
9.9359777072301e-09
2.73445353441631e-07
-1.23089187834593e-08
5.89097515132091e-09
-2.21433996739349e-07
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
142
(
-8.03864798630323e-08
-6.59731453736762e-08
-6.80097987861362e-08
-3.92230230266105e-08
-2.40365178583402e-07
-3.01426522491076e-07
-6.36365173963832e-08
-7.82069502354177e-08
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
404
(
6.9773510406134e-08
1.19422002604438e-07
4.059453474631e-08
3.82039012150976e-08
8.22980238450476e-08
9.77970874196837e-08
3.18352664487114e-08
2.77987650831859e-08
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
