CFD_results/short/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

deltaT          0.01;

endTime         2.0;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

adjustTimeStep  yes;

maxCo           5.0;

writeFormat     ascii;

writePrecision  15;

runTimeModifiable true;

libs
(
    // Needed for availability of porous baffle boundary in potentialFoam
    #include "turbulenceLib"
);

functions
{
}

// ************************************************************************* //
